In [1]:
import numpy as np
import pandas as pd

In [ ]:
Data ={
    "Name" : ["Aman","Saurav","Karan","Shubham","Abhishek",None,"Sameer"],
    "Age" : [22,23,np.nan,22,25,24,26],
    "Marks":[85,np.nan,88,90,56,72,np.nan],
    "Subject" : ["Math","Physics","Math","Chemistry","Math","Physics","Chemistry"]
}

{'Name': ['Aman', 'Saurav', 'Karan', 'Shubham', 'Abhishek', None, 'Sameer'], 'Age': [22, 23, nan, 22, 25, 24, 26], 'Marks': [85, nan, 88, 90, 56, 72, nan], 'Subject': ['Math', 'Physics', 'Math', 'Chemistry', 'Math', 'Physics', 'Chemistry']}
7
7
7
7

In [29]:
#df = panda dataframe(use np.nan for missing value)
df = pd.DataFrame(Data)
print(df)
#check shape
print(df.shape)
#display the datatype of the column
print(df.columns)
#generate a statistical summary(mean/min/max)for the numerical columns
df.describe()

       Name   Age  Marks    Subject
0      Aman  22.0   85.0       Math
1    Saurav  23.0    NaN    Physics
2     Karan   NaN   88.0       Math
3   Shubham  22.0   90.0  Chemistry
4  Abhishek  25.0   56.0       Math
5      None  24.0   72.0    Physics
6    Sameer  26.0    NaN  Chemistry
(7, 4)
Index(['Name', 'Age', 'Marks', 'Subject'], dtype='object')

             Age      Marks
count   6.000000   5.000000
mean   23.666667  78.200000
std     1.632993  14.254824
min    22.000000  56.000000
25%    22.250000  72.000000
50%    23.500000  85.000000
75%    24.750000  88.000000
max    26.000000  90.000000

In [36]:
#Filter and group the data
#Selection:create a view showing only the 'Name' and 'Marks' column
view = df[["Name","Marks"]]
print(view)
#Filtering: Select student who have scored more than 80marks
print("Student scoring more than 80 marks: ")
print(df[df["Marks"] > 80])
#complex filtering: select student older than 22 who also scored more than 80
print("MORE THAN 22 AND GREATER THAN 80 : ")
print(df[(df["Age"] > 22) & (df["Marks"] > 80)])
#Aggregation: count how many students are enrolled in each subject
print("Number of student enrolled in each course: ")
print(df["Subject"].value_counts())

       Name  Marks
0      Aman   85.0
1    Saurav    NaN
2     Karan   88.0
3   Shubham   90.0
4  Abhishek   56.0
5      None   72.0
6    Sameer    NaN
Student scoring more than 80 marks:
      Name   Age  Marks    Subject
0     Aman  22.0   85.0       Math
2    Karan   NaN   88.0       Math
3  Shubham  22.0   90.0  Chemistry
MORE THAN 22 AND GREATER THAN 80 :
Empty DataFrame
Columns: [Name, Age, Marks, Subject]
Index: []
Number of student enrolled in each course:
Subject
Math         3
Physics      2
Chemistry    2
Name: count, dtype: int64

In [45]:
#Order the data to find rankers
#Sort the dataframe by 'Marks'in descending order
print(df.sort_values("Marks",ascending=False))
#Use a specific Pandas function to find the top 2 highest scores(Scholarship Candidates) without sorting the whole dataframe manually
top2 = df.nlargest(2,"Marks")
print("TOP 2 HIGHEST")
print(top2)
#Identify the student with the lowest marks(remedial candidate)
print("Lowest : ")
lowest = df.nsmallest(1,"Marks")
print(lowest)

       Name   Age  Marks    Subject
3   Shubham  22.0   90.0  Chemistry
2     Karan   NaN   88.0       Math
0      Aman  22.0   85.0       Math
5      None  24.0   72.0    Physics
4  Abhishek  25.0   56.0       Math
1    Saurav  23.0    NaN    Physics
6    Sameer  26.0    NaN  Chemistry
TOP 2 HIGHEST
      Name   Age  Marks    Subject
3  Shubham  22.0   90.0  Chemistry
2    Karan   NaN   88.0       Math
Lowest :
       Name   Age  Marks Subject
4  Abhishek  25.0   56.0    Math

In [ ]:
#Handle missing value
#Calculate the total number of missing value(NAN) in each column
print(df.isnull().sum())
#Filter and display the rows where 'Marks' are missing

#Create a new Dataframe called cleaned_df by removing any rows that contains even a single missing value
#Compare theshape of cleaned_df vs original df

Name       1
Age        1
Marks      2
Subject    0
dtype: int64

In [ ]:
#Analyze the logic
#Technical Q: Look at the 'Marks' column in your output.Why are the values floats(eg,85.0) instead of integers?
#Technical Q: What is the risk of using inplace=True when dropping missing values?
#Business Q: Based on the data,what specific feedback should you give to the admin team regarding the "Name" column?

# GROUPBY
Analyze data category-wise